----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 128, 128]             864
       BatchNorm2d-2         [-1, 32, 128, 128]              64
              SiLU-3         [-1, 32, 128, 128]               0
            Conv2d-4         [-1, 32, 128, 128]             288
       BatchNorm2d-5         [-1, 32, 128, 128]              64
              SiLU-6         [-1, 32, 128, 128]               0
 AdaptiveAvgPool2d-7             [-1, 32, 1, 1]               0
            Conv2d-8              [-1, 8, 1, 1]             264
              SiLU-9              [-1, 8, 1, 1]               0
           Conv2d-10             [-1, 32, 1, 1]             288
          Sigmoid-11             [-1, 32, 1, 1]               0
SqueezeExcitation-12         [-1, 32, 128, 128]               0
           Conv2d-13         [-1, 16, 128, 128]             512
      BatchNorm2d-14         [-1, 16, 128, 128]              32
           MBConv-15         [-1, 16, 128, 128]               0
           Conv2d-16         [-1, 96, 128, 128]           1,536
      BatchNorm2d-17         [-1, 96, 128, 128]             192
             SiLU-18         [-1, 96, 128, 128]               0
           Conv2d-19           [-1, 96, 64, 64]             864
      BatchNorm2d-20           [-1, 96, 64, 64]             192
             SiLU-21           [-1, 96, 64, 64]               0
AdaptiveAvgPool2d-22             [-1, 96, 1, 1]               0
           Conv2d-23              [-1, 4, 1, 1]             388
             SiLU-24              [-1, 4, 1, 1]               0
           Conv2d-25             [-1, 96, 1, 1]             480
          Sigmoid-26             [-1, 96, 1, 1]               0
SqueezeExcitation-27           [-1, 96, 64, 64]               0
           Conv2d-28           [-1, 24, 64, 64]           2,304
      BatchNorm2d-29           [-1, 24, 64, 64]              48
           MBConv-30           [-1, 24, 64, 64]               0
           Conv2d-31          [-1, 144, 64, 64]           3,456
      BatchNorm2d-32          [-1, 144, 64, 64]             288
             SiLU-33          [-1, 144, 64, 64]               0
           Conv2d-34          [-1, 144, 64, 64]           1,296
      BatchNorm2d-35          [-1, 144, 64, 64]             288
             SiLU-36          [-1, 144, 64, 64]               0
AdaptiveAvgPool2d-37            [-1, 144, 1, 1]               0
           Conv2d-38              [-1, 6, 1, 1]             870
             SiLU-39              [-1, 6, 1, 1]               0
           Conv2d-40            [-1, 144, 1, 1]           1,008
          Sigmoid-41            [-1, 144, 1, 1]               0
SqueezeExcitation-42          [-1, 144, 64, 64]               0
           Conv2d-43           [-1, 24, 64, 64]           3,456
      BatchNorm2d-44           [-1, 24, 64, 64]              48
  StochasticDepth-45           [-1, 24, 64, 64]               0
           MBConv-46           [-1, 24, 64, 64]               0
           Conv2d-47          [-1, 144, 64, 64]           3,456
      BatchNorm2d-48          [-1, 144, 64, 64]             288
             SiLU-49          [-1, 144, 64, 64]               0
           Conv2d-50          [-1, 144, 32, 32]           3,600
      BatchNorm2d-51          [-1, 144, 32, 32]             288
             SiLU-52          [-1, 144, 32, 32]               0
AdaptiveAvgPool2d-53            [-1, 144, 1, 1]               0
           Conv2d-54              [-1, 6, 1, 1]             870
             SiLU-55              [-1, 6, 1, 1]               0
           Conv2d-56            [-1, 144, 1, 1]           1,008
          Sigmoid-57            [-1, 144, 1, 1]               0
SqueezeExcitation-58          [-1, 144, 32, 32]               0
           Conv2d-59           [-1, 40, 32, 32]           5,760
      BatchNorm2d-60           [-1, 40, 32, 32]              80
           MBConv-61           [-1, 40, 32, 32]               0
           Conv2d-62          [-1, 240, 32, 32]           9,600
      BatchNorm2d-63          [-1, 240, 32, 32]             480
             SiLU-64          [-1, 240, 32, 32]               0
           Conv2d-65          [-1, 240, 32, 32]           6,000
      BatchNorm2d-66          [-1, 240, 32, 32]             480
             SiLU-67          [-1, 240, 32, 32]               0
AdaptiveAvgPool2d-68            [-1, 240, 1, 1]               0
           Conv2d-69             [-1, 10, 1, 1]           2,410
             SiLU-70             [-1, 10, 1, 1]               0
           Conv2d-71            [-1, 240, 1, 1]           2,640
          Sigmoid-72            [-1, 240, 1, 1]               0
SqueezeExcitation-73          [-1, 240, 32, 32]               0
           Conv2d-74           [-1, 40, 32, 32]           9,600
      BatchNorm2d-75           [-1, 40, 32, 32]              80
  StochasticDepth-76           [-1, 40, 32, 32]               0
           MBConv-77           [-1, 40, 32, 32]               0
           Conv2d-78          [-1, 240, 32, 32]           9,600
      BatchNorm2d-79          [-1, 240, 32, 32]             480
             SiLU-80          [-1, 240, 32, 32]               0
           Conv2d-81          [-1, 240, 16, 16]           2,160
      BatchNorm2d-82          [-1, 240, 16, 16]             480
             SiLU-83          [-1, 240, 16, 16]               0
AdaptiveAvgPool2d-84            [-1, 240, 1, 1]               0
           Conv2d-85             [-1, 10, 1, 1]           2,410
             SiLU-86             [-1, 10, 1, 1]               0
           Conv2d-87            [-1, 240, 1, 1]           2,640
          Sigmoid-88            [-1, 240, 1, 1]               0
SqueezeExcitation-89          [-1, 240, 16, 16]               0
           Conv2d-90           [-1, 80, 16, 16]          19,200
      BatchNorm2d-91           [-1, 80, 16, 16]             160
           MBConv-92           [-1, 80, 16, 16]               0
           Conv2d-93          [-1, 480, 16, 16]          38,400
      BatchNorm2d-94          [-1, 480, 16, 16]             960
             SiLU-95          [-1, 480, 16, 16]               0
           Conv2d-96          [-1, 480, 16, 16]           4,320
      BatchNorm2d-97          [-1, 480, 16, 16]             960
             SiLU-98          [-1, 480, 16, 16]               0
AdaptiveAvgPool2d-99            [-1, 480, 1, 1]               0
          Conv2d-100             [-1, 20, 1, 1]           9,620
            SiLU-101             [-1, 20, 1, 1]               0
          Conv2d-102            [-1, 480, 1, 1]          10,080
         Sigmoid-103            [-1, 480, 1, 1]               0
SqueezeExcitation-104          [-1, 480, 16, 16]               0
          Conv2d-105           [-1, 80, 16, 16]          38,400
     BatchNorm2d-106           [-1, 80, 16, 16]             160
 StochasticDepth-107           [-1, 80, 16, 16]               0
          MBConv-108           [-1, 80, 16, 16]               0
          Conv2d-109          [-1, 480, 16, 16]          38,400
     BatchNorm2d-110          [-1, 480, 16, 16]             960
            SiLU-111          [-1, 480, 16, 16]               0
          Conv2d-112          [-1, 480, 16, 16]           4,320
     BatchNorm2d-113          [-1, 480, 16, 16]             960
            SiLU-114          [-1, 480, 16, 16]               0
AdaptiveAvgPool2d-115            [-1, 480, 1, 1]               0
          Conv2d-116             [-1, 20, 1, 1]           9,620
            SiLU-117             [-1, 20, 1, 1]               0
          Conv2d-118            [-1, 480, 1, 1]          10,080
         Sigmoid-119            [-1, 480, 1, 1]               0
SqueezeExcitation-120          [-1, 480, 16, 16]               0
          Conv2d-121           [-1, 80, 16, 16]          38,400
     BatchNorm2d-122           [-1, 80, 16, 16]             160
 StochasticDepth-123           [-1, 80, 16, 16]               0
          MBConv-124           [-1, 80, 16, 16]               0
          Conv2d-125          [-1, 480, 16, 16]          38,400
     BatchNorm2d-126          [-1, 480, 16, 16]             960
            SiLU-127          [-1, 480, 16, 16]               0
          Conv2d-128          [-1, 480, 16, 16]          12,000
     BatchNorm2d-129          [-1, 480, 16, 16]             960
            SiLU-130          [-1, 480, 16, 16]               0
AdaptiveAvgPool2d-131            [-1, 480, 1, 1]               0
          Conv2d-132             [-1, 20, 1, 1]           9,620
            SiLU-133             [-1, 20, 1, 1]               0
          Conv2d-134            [-1, 480, 1, 1]          10,080
         Sigmoid-135            [-1, 480, 1, 1]               0
SqueezeExcitation-136          [-1, 480, 16, 16]               0
          Conv2d-137          [-1, 112, 16, 16]          53,760
     BatchNorm2d-138          [-1, 112, 16, 16]             224
          MBConv-139          [-1, 112, 16, 16]               0
          Conv2d-140          [-1, 672, 16, 16]          75,264
     BatchNorm2d-141          [-1, 672, 16, 16]           1,344
            SiLU-142          [-1, 672, 16, 16]               0
          Conv2d-143          [-1, 672, 16, 16]          16,800
     BatchNorm2d-144          [-1, 672, 16, 16]           1,344
            SiLU-145          [-1, 672, 16, 16]               0
AdaptiveAvgPool2d-146            [-1, 672, 1, 1]               0
          Conv2d-147             [-1, 28, 1, 1]          18,844
            SiLU-148             [-1, 28, 1, 1]               0
          Conv2d-149            [-1, 672, 1, 1]          19,488
         Sigmoid-150            [-1, 672, 1, 1]               0
SqueezeExcitation-151          [-1, 672, 16, 16]               0
          Conv2d-152          [-1, 112, 16, 16]          75,264
     BatchNorm2d-153          [-1, 112, 16, 16]             224
 StochasticDepth-154          [-1, 112, 16, 16]               0
          MBConv-155          [-1, 112, 16, 16]               0
          Conv2d-156          [-1, 672, 16, 16]          75,264
     BatchNorm2d-157          [-1, 672, 16, 16]           1,344
            SiLU-158          [-1, 672, 16, 16]               0
          Conv2d-159          [-1, 672, 16, 16]          16,800
     BatchNorm2d-160          [-1, 672, 16, 16]           1,344
            SiLU-161          [-1, 672, 16, 16]               0
AdaptiveAvgPool2d-162            [-1, 672, 1, 1]               0
          Conv2d-163             [-1, 28, 1, 1]          18,844
            SiLU-164             [-1, 28, 1, 1]               0
          Conv2d-165            [-1, 672, 1, 1]          19,488
         Sigmoid-166            [-1, 672, 1, 1]               0
SqueezeExcitation-167          [-1, 672, 16, 16]               0
          Conv2d-168          [-1, 112, 16, 16]          75,264
     BatchNorm2d-169          [-1, 112, 16, 16]             224
 StochasticDepth-170          [-1, 112, 16, 16]               0
          MBConv-171          [-1, 112, 16, 16]               0
          Conv2d-172          [-1, 672, 16, 16]          75,264
     BatchNorm2d-173          [-1, 672, 16, 16]           1,344
            SiLU-174          [-1, 672, 16, 16]               0
          Conv2d-175            [-1, 672, 8, 8]          16,800
     BatchNorm2d-176            [-1, 672, 8, 8]           1,344
            SiLU-177            [-1, 672, 8, 8]               0
AdaptiveAvgPool2d-178            [-1, 672, 1, 1]               0
          Conv2d-179             [-1, 28, 1, 1]          18,844
            SiLU-180             [-1, 28, 1, 1]               0
          Conv2d-181            [-1, 672, 1, 1]          19,488
         Sigmoid-182            [-1, 672, 1, 1]               0
SqueezeExcitation-183            [-1, 672, 8, 8]               0
          Conv2d-184            [-1, 192, 8, 8]         129,024
     BatchNorm2d-185            [-1, 192, 8, 8]             384
          MBConv-186            [-1, 192, 8, 8]               0
          Conv2d-187           [-1, 1152, 8, 8]         221,184
     BatchNorm2d-188           [-1, 1152, 8, 8]           2,304
            SiLU-189           [-1, 1152, 8, 8]               0
          Conv2d-190           [-1, 1152, 8, 8]          28,800
     BatchNorm2d-191           [-1, 1152, 8, 8]           2,304
            SiLU-192           [-1, 1152, 8, 8]               0
AdaptiveAvgPool2d-193           [-1, 1152, 1, 1]               0
          Conv2d-194             [-1, 48, 1, 1]          55,344
            SiLU-195             [-1, 48, 1, 1]               0
          Conv2d-196           [-1, 1152, 1, 1]          56,448
         Sigmoid-197           [-1, 1152, 1, 1]               0
SqueezeExcitation-198           [-1, 1152, 8, 8]               0
          Conv2d-199            [-1, 192, 8, 8]         221,184
     BatchNorm2d-200            [-1, 192, 8, 8]             384
 StochasticDepth-201            [-1, 192, 8, 8]               0
          MBConv-202            [-1, 192, 8, 8]               0
          Conv2d-203           [-1, 1152, 8, 8]         221,184
     BatchNorm2d-204           [-1, 1152, 8, 8]           2,304
            SiLU-205           [-1, 1152, 8, 8]               0
          Conv2d-206           [-1, 1152, 8, 8]          28,800
     BatchNorm2d-207           [-1, 1152, 8, 8]           2,304
            SiLU-208           [-1, 1152, 8, 8]               0
AdaptiveAvgPool2d-209           [-1, 1152, 1, 1]               0
          Conv2d-210             [-1, 48, 1, 1]          55,344
            SiLU-211             [-1, 48, 1, 1]               0
          Conv2d-212           [-1, 1152, 1, 1]          56,448
         Sigmoid-213           [-1, 1152, 1, 1]               0
SqueezeExcitation-214           [-1, 1152, 8, 8]               0
          Conv2d-215            [-1, 192, 8, 8]         221,184
     BatchNorm2d-216            [-1, 192, 8, 8]             384
 StochasticDepth-217            [-1, 192, 8, 8]               0
          MBConv-218            [-1, 192, 8, 8]               0
          Conv2d-219           [-1, 1152, 8, 8]         221,184
     BatchNorm2d-220           [-1, 1152, 8, 8]           2,304
            SiLU-221           [-1, 1152, 8, 8]               0
          Conv2d-222           [-1, 1152, 8, 8]          28,800
     BatchNorm2d-223           [-1, 1152, 8, 8]           2,304
            SiLU-224           [-1, 1152, 8, 8]               0
AdaptiveAvgPool2d-225           [-1, 1152, 1, 1]               0
          Conv2d-226             [-1, 48, 1, 1]          55,344
            SiLU-227             [-1, 48, 1, 1]               0
          Conv2d-228           [-1, 1152, 1, 1]          56,448
         Sigmoid-229           [-1, 1152, 1, 1]               0
SqueezeExcitation-230           [-1, 1152, 8, 8]               0
          Conv2d-231            [-1, 192, 8, 8]         221,184
     BatchNorm2d-232            [-1, 192, 8, 8]             384
 StochasticDepth-233            [-1, 192, 8, 8]               0
          MBConv-234            [-1, 192, 8, 8]               0
          Conv2d-235           [-1, 1152, 8, 8]         221,184
     BatchNorm2d-236           [-1, 1152, 8, 8]           2,304
            SiLU-237           [-1, 1152, 8, 8]               0
          Conv2d-238           [-1, 1152, 8, 8]          10,368
     BatchNorm2d-239           [-1, 1152, 8, 8]           2,304
            SiLU-240           [-1, 1152, 8, 8]               0
AdaptiveAvgPool2d-241           [-1, 1152, 1, 1]               0
          Conv2d-242             [-1, 48, 1, 1]          55,344
            SiLU-243             [-1, 48, 1, 1]               0
          Conv2d-244           [-1, 1152, 1, 1]          56,448
         Sigmoid-245           [-1, 1152, 1, 1]               0
SqueezeExcitation-246           [-1, 1152, 8, 8]               0
          Conv2d-247            [-1, 320, 8, 8]         368,640
     BatchNorm2d-248            [-1, 320, 8, 8]             640
          MBConv-249            [-1, 320, 8, 8]               0
          Conv2d-250           [-1, 1280, 8, 8]         409,600
     BatchNorm2d-251           [-1, 1280, 8, 8]           2,560
            SiLU-252           [-1, 1280, 8, 8]               0
          Conv2d-253        [-1, 128, 128, 128]           2,176
            SELU-254        [-1, 128, 128, 128]               0
          Conv2d-255         [-1, 16, 128, 128]           2,064
            ReLU-256         [-1, 16, 128, 128]               0
          Conv2d-257          [-1, 1, 128, 128]              17
         Sigmoid-258          [-1, 1, 128, 128]               0
         PALayer-259        [-1, 128, 128, 128]               0
AdaptiveAvgPool2d-260            [-1, 128, 1, 1]               0
          Conv2d-261             [-1, 16, 1, 1]           2,064
            ReLU-262             [-1, 16, 1, 1]               0
          Conv2d-263            [-1, 128, 1, 1]           2,176
         Sigmoid-264            [-1, 128, 1, 1]               0
         CALayer-265        [-1, 128, 128, 128]               0
          Conv2d-266          [-1, 128, 64, 64]           3,200
            SELU-267          [-1, 128, 64, 64]               0
          Conv2d-268           [-1, 16, 64, 64]           2,064
            ReLU-269           [-1, 16, 64, 64]               0
          Conv2d-270            [-1, 1, 64, 64]              17
         Sigmoid-271            [-1, 1, 64, 64]               0
         PALayer-272          [-1, 128, 64, 64]               0
AdaptiveAvgPool2d-273            [-1, 128, 1, 1]               0
          Conv2d-274             [-1, 16, 1, 1]           2,064
            ReLU-275             [-1, 16, 1, 1]               0
          Conv2d-276            [-1, 128, 1, 1]           2,176
         Sigmoid-277            [-1, 128, 1, 1]               0
         CALayer-278          [-1, 128, 64, 64]               0
          Conv2d-279          [-1, 128, 32, 32]           5,248
            SELU-280          [-1, 128, 32, 32]               0
          Conv2d-281           [-1, 16, 32, 32]           2,064
            ReLU-282           [-1, 16, 32, 32]               0
          Conv2d-283            [-1, 1, 32, 32]              17
         Sigmoid-284            [-1, 1, 32, 32]               0
         PALayer-285          [-1, 128, 32, 32]               0
AdaptiveAvgPool2d-286            [-1, 128, 1, 1]               0
          Conv2d-287             [-1, 16, 1, 1]           2,064
            ReLU-288             [-1, 16, 1, 1]               0
          Conv2d-289            [-1, 128, 1, 1]           2,176
         Sigmoid-290            [-1, 128, 1, 1]               0
         CALayer-291          [-1, 128, 32, 32]               0
          Conv2d-292          [-1, 128, 16, 16]          10,368
            SELU-293          [-1, 128, 16, 16]               0
          Conv2d-294           [-1, 16, 16, 16]           2,064
            ReLU-295           [-1, 16, 16, 16]               0
          Conv2d-296            [-1, 1, 16, 16]              17
         Sigmoid-297            [-1, 1, 16, 16]               0
         PALayer-298          [-1, 128, 16, 16]               0
AdaptiveAvgPool2d-299            [-1, 128, 1, 1]               0
          Conv2d-300             [-1, 16, 1, 1]           2,064
            ReLU-301             [-1, 16, 1, 1]               0
          Conv2d-302            [-1, 128, 1, 1]           2,176
         Sigmoid-303            [-1, 128, 1, 1]               0
         CALayer-304          [-1, 128, 16, 16]               0
          Conv2d-305        [-1, 128, 128, 128]         589,952
            SELU-306        [-1, 128, 128, 128]               0
          Conv2d-307        [-1, 128, 128, 128]         147,584
            SELU-308        [-1, 128, 128, 128]               0
          Conv2d-309        [-1, 512, 128, 128]          66,048
          Conv2d-310        [-1, 128, 128, 128]         147,584
            SELU-311        [-1, 128, 128, 128]               0
          Conv2d-312        [-1, 128, 128, 128]         147,584
            SELU-313        [-1, 128, 128, 128]               0
          Conv2d-314        [-1, 128, 128, 128]          16,512
          Conv2d-315        [-1, 128, 128, 128]         589,952
            SELU-316        [-1, 128, 128, 128]               0
          Conv2d-317        [-1, 128, 128, 128]         147,584
            SELU-318        [-1, 128, 128, 128]               0
          Conv2d-319        [-1, 512, 128, 128]          66,048
          Conv2d-320        [-1, 128, 128, 128]         147,584
            SELU-321        [-1, 128, 128, 128]               0
          Conv2d-322        [-1, 128, 128, 128]         147,584
            SELU-323        [-1, 128, 128, 128]               0
          Conv2d-324        [-1, 128, 128, 128]          16,512
          Conv2d-325        [-1, 128, 128, 128]         589,952
            SELU-326        [-1, 128, 128, 128]               0
          Conv2d-327        [-1, 128, 128, 128]         147,584
            SELU-328        [-1, 128, 128, 128]               0
          Conv2d-329        [-1, 512, 128, 128]          66,048
          Conv2d-330        [-1, 128, 128, 128]         147,584
            SELU-331        [-1, 128, 128, 128]               0
          Conv2d-332        [-1, 128, 128, 128]         147,584
            SELU-333        [-1, 128, 128, 128]               0
          Conv2d-334        [-1, 128, 128, 128]          16,512
          Conv2d-335        [-1, 128, 128, 128]         589,952
            SELU-336        [-1, 128, 128, 128]               0
          Conv2d-337        [-1, 128, 128, 128]         147,584
            SELU-338        [-1, 128, 128, 128]               0
          Conv2d-339        [-1, 512, 128, 128]          66,048
          Conv2d-340        [-1, 128, 128, 128]         147,584
            SELU-341        [-1, 128, 128, 128]               0
          Conv2d-342        [-1, 128, 128, 128]         147,584
            SELU-343        [-1, 128, 128, 128]               0
          Conv2d-344        [-1, 128, 128, 128]          16,512
          Conv2d-345        [-1, 128, 128, 128]         589,952
            SELU-346        [-1, 128, 128, 128]               0
          Conv2d-347        [-1, 128, 128, 128]         147,584
            SELU-348        [-1, 128, 128, 128]               0
          Conv2d-349        [-1, 512, 128, 128]          66,048
          Conv2d-350        [-1, 128, 128, 128]         147,584
            SELU-351        [-1, 128, 128, 128]               0
          Conv2d-352        [-1, 128, 128, 128]         147,584
            SELU-353        [-1, 128, 128, 128]               0
          Conv2d-354        [-1, 128, 128, 128]          16,512
AdaptiveAvgPool2d-355            [-1, 128, 1, 1]               0
          Conv2d-356            [-1, 128, 1, 1]          16,512
            SELU-357            [-1, 128, 1, 1]               0
          Conv2d-358            [-1, 128, 1, 1]          16,512
            SELU-359            [-1, 128, 1, 1]               0
          Conv2d-360              [-1, 1, 1, 1]             129
         Sigmoid-361              [-1, 1, 1, 1]               0
          Conv2d-362         [-1, 64, 128, 128]          73,792
            SELU-363         [-1, 64, 128, 128]               0
          Conv2d-364          [-1, 1, 128, 128]              65
         Sigmoid-365          [-1, 1, 128, 128]               0
          Conv2d-366         [-1, 64, 128, 128]          73,792
            SELU-367         [-1, 64, 128, 128]               0
          Conv2d-368          [-1, 3, 128, 128]             195
          Conv2d-369         [-1, 64, 256, 256]           1,792
            ReLU-370         [-1, 64, 256, 256]               0
          Conv2d-371        [-1, 128, 256, 256]          73,856
            ReLU-372        [-1, 128, 256, 256]               0
          Conv2d-373         [-1, 64, 256, 256]          73,792
            ReLU-374         [-1, 64, 256, 256]               0
          Conv2d-375          [-1, 3, 256, 256]           1,731
            Tanh-376          [-1, 3, 256, 256]               0
          Refine-377          [-1, 3, 256, 256]               0
          Conv2d-378         [-1, 64, 128, 128]          73,792
            SELU-379         [-1, 64, 128, 128]               0
          Conv2d-380          [-1, 3, 128, 128]             195
          Conv2d-381         [-1, 64, 256, 256]           1,792
            ReLU-382         [-1, 64, 256, 256]               0
          Conv2d-383        [-1, 128, 256, 256]          73,856
            ReLU-384        [-1, 128, 256, 256]               0
          Conv2d-385         [-1, 64, 256, 256]          73,792
            ReLU-386         [-1, 64, 256, 256]               0
          Conv2d-387          [-1, 3, 256, 256]           1,731
            Tanh-388          [-1, 3, 256, 256]               0
          Refine-389          [-1, 3, 256, 256]               0
          Conv2d-390         [-1, 64, 128, 128]          73,792
            SELU-391         [-1, 64, 128, 128]               0
          Conv2d-392          [-1, 3, 128, 128]             195
          Conv2d-393         [-1, 64, 256, 256]           1,792
            ReLU-394         [-1, 64, 256, 256]               0
          Conv2d-395        [-1, 128, 256, 256]          73,856
            ReLU-396        [-1, 128, 256, 256]               0
          Conv2d-397         [-1, 64, 256, 256]          73,792
            ReLU-398         [-1, 64, 256, 256]               0
          Conv2d-399          [-1, 3, 256, 256]           1,731
            Tanh-400          [-1, 3, 256, 256]               0
          Refine-401          [-1, 3, 256, 256]               0
          Conv2d-402         [-1, 64, 128, 128]          73,792
            SELU-403         [-1, 64, 128, 128]               0
          Conv2d-404          [-1, 3, 128, 128]             195
          Conv2d-405         [-1, 64, 256, 256]           1,792
            ReLU-406         [-1, 64, 256, 256]               0
          Conv2d-407        [-1, 128, 256, 256]          73,856
            ReLU-408        [-1, 128, 256, 256]               0
          Conv2d-409         [-1, 64, 256, 256]          73,792
            ReLU-410         [-1, 64, 256, 256]               0
          Conv2d-411          [-1, 3, 256, 256]           1,731
            Tanh-412          [-1, 3, 256, 256]               0
          Refine-413          [-1, 3, 256, 256]               0
          Conv2d-414        [-1, 512, 128, 128]       2,359,808
            SELU-415        [-1, 512, 128, 128]               0
          Conv2d-416        [-1, 512, 128, 128]       2,359,808
            SELU-417        [-1, 512, 128, 128]               0
          Conv2d-418        [-1, 128, 128, 128]          65,664
            SELU-419        [-1, 128, 128, 128]               0
          Conv2d-420         [-1, 64, 128, 128]          73,792
            SELU-421         [-1, 64, 128, 128]               0
          Conv2d-422         [-1, 64, 128, 128]          36,928
            SELU-423         [-1, 64, 128, 128]               0
          Conv2d-424         [-1, 15, 128, 128]             975
================================================================
Total params: 15,534,761
Trainable params: 15,534,761
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 2803.00
Params size (MB): 59.26
Estimated Total Size (MB): 2863.01
