----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           1,792
              ReLU-2         [-1, 64, 256, 256]               0
            Conv2d-3         [-1, 64, 256, 256]          36,928
              ReLU-4         [-1, 64, 256, 256]               0
         MaxPool2d-5         [-1, 64, 128, 128]               0
            Conv2d-6        [-1, 128, 128, 128]          73,856
              ReLU-7        [-1, 128, 128, 128]               0
            Conv2d-8        [-1, 128, 128, 128]         147,584
              ReLU-9        [-1, 128, 128, 128]               0
        MaxPool2d-10          [-1, 128, 64, 64]               0
           Conv2d-11          [-1, 256, 64, 64]         295,168
             ReLU-12          [-1, 256, 64, 64]               0
           Conv2d-13          [-1, 256, 64, 64]         590,080
             ReLU-14          [-1, 256, 64, 64]               0
           Conv2d-15          [-1, 256, 64, 64]         590,080
             ReLU-16          [-1, 256, 64, 64]               0
           Conv2d-17          [-1, 256, 64, 64]         590,080
             ReLU-18          [-1, 256, 64, 64]               0
        MaxPool2d-19          [-1, 256, 32, 32]               0
           Conv2d-20          [-1, 512, 32, 32]       1,180,160
             ReLU-21          [-1, 512, 32, 32]               0
           Conv2d-22          [-1, 512, 32, 32]       2,359,808
             ReLU-23          [-1, 512, 32, 32]               0
           Conv2d-24          [-1, 512, 32, 32]       2,359,808
             ReLU-25          [-1, 512, 32, 32]               0
           Conv2d-26          [-1, 512, 32, 32]       2,359,808
             ReLU-27          [-1, 512, 32, 32]               0
        MaxPool2d-28          [-1, 512, 16, 16]               0
           Conv2d-29          [-1, 512, 16, 16]       2,359,808
             ReLU-30          [-1, 512, 16, 16]               0
           Conv2d-31          [-1, 512, 16, 16]       2,359,808
             ReLU-32          [-1, 512, 16, 16]               0
           Conv2d-33          [-1, 512, 16, 16]       2,359,808
             ReLU-34          [-1, 512, 16, 16]               0
           Conv2d-35          [-1, 512, 16, 16]       2,359,808
             ReLU-36          [-1, 512, 16, 16]               0
        MaxPool2d-37            [-1, 512, 8, 8]               0
AdaptiveAvgPool2d-38            [-1, 512, 1, 1]               0
           Conv2d-39           [-1, 1024, 1, 1]         525,312
        LeakyReLU-40           [-1, 1024, 1, 1]               0
           Conv2d-41              [-1, 1, 1, 1]           1,025
================================================================
Total params: 20,550,721
Trainable params: 526,337
Non-trainable params: 20,024,384
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 311.27
Params size (MB): 78.39
Estimated Total Size (MB): 390.41
----------------------------------------------------------------
